; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-10)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	)
(:init
	(at plane1 city8)
	(= (capacity plane1) 11799)
	(= (fuel plane1) 4204)
	(= (slow-burn plane1) 5)
	(= (fast-burn plane1) 19)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 6)
	(at plane2 city3)
	(= (capacity plane2) 9009)
	(= (fuel plane2) 705)
	(= (slow-burn plane2) 3)
	(= (fast-burn plane2) 11)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 9)
	(at plane3 city3)
	(= (capacity plane3) 4544)
	(= (fuel plane3) 1170)
	(= (slow-burn plane3) 2)
	(= (fast-burn plane3) 5)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 2)
	(at plane4 city8)
	(= (capacity plane4) 14620)
	(= (fuel plane4) 2675)
	(= (slow-burn plane4) 5)
	(= (fast-burn plane4) 10)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 7)
	(at plane5 city4)
	(= (capacity plane5) 7562)
	(= (fuel plane5) 1632)
	(= (slow-burn plane5) 3)
	(= (fast-burn plane5) 8)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 9)
	(at person1 city7)
	(at person2 city0)
	(at person3 city1)
	(at person4 city0)
	(at person5 city3)
	(at person6 city5)
	(at person7 city2)
	(at person8 city3)
	(at person9 city8)
	(at person10 city3)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 874)
	(= (distance city0 city2) 827)
	(= (distance city0 city3) 896)
	(= (distance city0 city4) 530)
	(= (distance city0 city5) 536)
	(= (distance city0 city6) 593)
	(= (distance city0 city7) 928)
	(= (distance city0 city8) 976)
	(= (distance city1 city0) 874)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 703)
	(= (distance city1 city3) 596)
	(= (distance city1 city4) 691)
	(= (distance city1 city5) 791)
	(= (distance city1 city6) 559)
	(= (distance city1 city7) 868)
	(= (distance city1 city8) 791)
	(= (distance city2 city0) 827)
	(= (distance city2 city1) 703)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 588)
	(= (distance city2 city4) 721)
	(= (distance city2 city5) 785)
	(= (distance city2 city6) 723)
	(= (distance city2 city7) 532)
	(= (distance city2 city8) 558)
	(= (distance city3 city0) 896)
	(= (distance city3 city1) 596)
	(= (distance city3 city2) 588)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 660)
	(= (distance city3 city5) 929)
	(= (distance city3 city6) 875)
	(= (distance city3 city7) 512)
	(= (distance city3 city8) 756)
	(= (distance city4 city0) 530)
	(= (distance city4 city1) 691)
	(= (distance city4 city2) 721)
	(= (distance city4 city3) 660)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 568)
	(= (distance city4 city6) 754)
	(= (distance city4 city7) 989)
	(= (distance city4 city8) 598)
	(= (distance city5 city0) 536)
	(= (distance city5 city1) 791)
	(= (distance city5 city2) 785)
	(= (distance city5 city3) 929)
	(= (distance city5 city4) 568)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 996)
	(= (distance city5 city7) 864)
	(= (distance city5 city8) 926)
	(= (distance city6 city0) 593)
	(= (distance city6 city1) 559)
	(= (distance city6 city2) 723)
	(= (distance city6 city3) 875)
	(= (distance city6 city4) 754)
	(= (distance city6 city5) 996)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 892)
	(= (distance city6 city8) 895)
	(= (distance city7 city0) 928)
	(= (distance city7 city1) 868)
	(= (distance city7 city2) 532)
	(= (distance city7 city3) 512)
	(= (distance city7 city4) 989)
	(= (distance city7 city5) 864)
	(= (distance city7 city6) 892)
	(= (distance city7 city7) 0)
	(= (distance city7 city8) 962)
	(= (distance city8 city0) 976)
	(= (distance city8 city1) 791)
	(= (distance city8 city2) 558)
	(= (distance city8 city3) 756)
	(= (distance city8 city4) 598)
	(= (distance city8 city5) 926)
	(= (distance city8 city6) 895)
	(= (distance city8 city7) 962)
	(= (distance city8 city8) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city2)
	(at person2 city4)
	(at person3 city5)
	(at person4 city1)
	(at person5 city6)
	(at person6 city7)
	(at person7 city0)
	(at person8 city4)
	(at person9 city8)
	(at person10 city3)
	))

(:metric minimize (+ (* 2 (total-time))  (* 4 (total-fuel-used))))
)

; plan
1. (refuel plane3 city3)
   changed: (fuel plane3) from 1170 to 4544
   goals met: 2 of 10
2. (fly plane1 city8 city2)
   deleted: (at plane1 city8)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 0 to 2790, (fuel plane1) from 4204 to 1414
   goals met: 2 of 10
3. (board person5 plane3 city3)
   deleted: (at person5 city3)
   added: (in person5 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 2 of 10
4. (board person8 plane3 city3)
   deleted: (at person8 city3)
   added: (in person8 plane3)
   changed: (onboard plane3) from 1 to 2
   goals met: 2 of 10
5. (fly plane3 city3 city1)
   deleted: (at plane3 city3)
   added: (at plane3 city1)
   changed: (total-fuel-used) from 2790 to 3982, (fuel plane3) from 4544 to 3352
   goals met: 2 of 10
6. (board person3 plane3 city1)
   deleted: (at person3 city1)
   added: (in person3 plane3)
   changed: (onboard plane3) from 2 to 3
   goals met: 2 of 10
7. (fly plane3 city1 city2)
   deleted: (at plane3 city1)
   added: (at plane3 city2)
   changed: (total-fuel-used) from 3982 to 5388, (fuel plane3) from 3352 to 1946
   goals met: 2 of 10
8. (board person7 plane3 city2)
   deleted: (at person7 city2)
   added: (in person7 plane3)
   changed: (onboard plane3) from 3 to 4
   goals met: 2 of 10
9. (fly plane5 city4 city0)
   deleted: (at plane5 city4)
   added: (at plane5 city0)
   changed: (total-fuel-used) from 5388 to 6978, (fuel plane5) from 1632 to 42
   goals met: 2 of 10
10. (board person4 plane5 city0)
   deleted: (at person4 city0)
   added: (in person4 plane5)
   changed: (onboard plane5) from 0 to 1
   goals met: 2 of 10
11. (refuel plane5 city0)
   changed: (fuel plane5) from 42 to 7562
   goals met: 2 of 10
12. (board person2 plane5 city0)
   deleted: (at person2 city0)
   added: (in person2 plane5)
   changed: (onboard plane5) from 1 to 2
   goals met: 2 of 10
13. (zoom plane5 city0 city1)
   deleted: (at plane5 city0)
   added: (at plane5 city1)
   changed: (total-fuel-used) from 6978 to 13970, (fuel plane5) from 7562 to 570
   goals met: 2 of 10
14. (debark person4 plane5 city1)
   deleted: (in person4 plane5)
   added: (at person4 city1)
   changed: (onboard plane5) from 2 to 1
   goals met: 3 of 10
15. (refuel plane5 city1)
   changed: (fuel plane5) from 570 to 7562
   goals met: 3 of 10
16. (fly plane5 city1 city4)
   deleted: (at plane5 city1)
   added: (at plane5 city4)
   changed: (total-fuel-used) from 13970 to 16043, (fuel plane5) from 7562 to 5489
   goals met: 3 of 10
17. (debark person2 plane5 city4)
   deleted: (in person2 plane5)
   added: (at person2 city4)
   changed: (onboard plane5) from 1 to 0
   goals met: 4 of 10
18. (fly plane5 city4 city7)
   deleted: (at plane5 city4)
   added: (at plane5 city7)
   changed: (total-fuel-used) from 16043 to 19010, (fuel plane5) from 5489 to 2522
   goals met: 4 of 10
19. (board person1 plane5 city7)
   deleted: (at person1 city7)
   added: (in person1 plane5)
   changed: (onboard plane5) from 0 to 1
   goals met: 4 of 10
20. (fly plane5 city7 city2)
   deleted: (at plane5 city7)
   added: (at plane5 city2)
   changed: (total-fuel-used) from 19010 to 20606, (fuel plane5) from 2522 to 926
   goals met: 4 of 10
21. (debark person1 plane5 city2)
   deleted: (in person1 plane5)
   added: (at person1 city2)
   changed: (onboard plane5) from 1 to 0
   goals met: 5 of 10
22. (fly plane3 city2 city5)
   deleted: (at plane3 city2)
   added: (at plane3 city5)
   changed: (total-fuel-used) from 20606 to 22176, (fuel plane3) from 1946 to 376
   goals met: 5 of 10
23. (board person6 plane3 city5)
   deleted: (at person6 city5)
   added: (in person6 plane3)
   changed: (onboard plane3) from 4 to 5
   goals met: 5 of 10
24. (debark person3 plane3 city5)
   deleted: (in person3 plane3)
   added: (at person3 city5)
   changed: (onboard plane3) from 5 to 4
   goals met: 6 of 10
25. (refuel plane3 city5)
   changed: (fuel plane3) from 376 to 4544
   goals met: 6 of 10
26. (fly plane3 city5 city6)
   deleted: (at plane3 city5)
   added: (at plane3 city6)
   changed: (total-fuel-used) from 22176 to 24168, (fuel plane3) from 4544 to 2552
   goals met: 6 of 10
27. (debark person5 plane3 city6)
   deleted: (in person5 plane3)
   added: (at person5 city6)
   changed: (onboard plane3) from 4 to 3
   goals met: 7 of 10
28. (fly plane3 city6 city7)
   deleted: (at plane3 city6)
   added: (at plane3 city7)
   changed: (total-fuel-used) from 24168 to 25952, (fuel plane3) from 2552 to 768
   goals met: 7 of 10
29. (debark person6 plane3 city7)
   deleted: (in person6 plane3)
   added: (at person6 city7)
   changed: (onboard plane3) from 3 to 2
   goals met: 8 of 10
30. (refuel plane3 city7)
   changed: (fuel plane3) from 768 to 4544
   goals met: 8 of 10
31. (fly plane3 city7 city0)
   deleted: (at plane3 city7)
   added: (at plane3 city0)
   changed: (total-fuel-used) from 25952 to 27808, (fuel plane3) from 4544 to 2688
   goals met: 8 of 10
32. (debark person7 plane3 city0)
   deleted: (in person7 plane3)
   added: (at person7 city0)
   changed: (onboard plane3) from 2 to 1
   goals met: 9 of 10
33. (fly plane3 city0 city4)
   deleted: (at plane3 city0)
   added: (at plane3 city4)
   changed: (total-fuel-used) from 27808 to 28868, (fuel plane3) from 2688 to 1628
   goals met: 9 of 10
34. (debark person8 plane3 city4)
   deleted: (in person8 plane3)
   added: (at person8 city4)
   changed: (onboard plane3) from 1 to 0
   goals met: 10 of 10
